using System;
using UnityEngine;

public class DataManager : MonoBehaviour
{
    // Start is called once before the first execution of Update after the MonoBehaviour is created

    public int[][] enemyStats = new int[76][]
    {
        new[] {0, 0 },
        new[] {338, 0 },
        new[] {425, 0 },
        new[] {575, 0 },
        new[] {750, 2 },
        new[] {950, 3 },
        new[] {1275, 3 },
        new[] {1625, 4 },
        new[] {2150, 5 },
        new[] {2550, 6 },
        new[] {119625, 13}, //10라 보스
        new[] {2750, 7 },
        new[] {3500, 8 },
        new[] {4475, 9 },
        new[] {5600, 11 },
        new[] {9559, 12 },
        new[] {13103, 14 },
        new[] {15931, 16 },
        new[] {17793, 17 },
        new[] {20048, 18 },
        new[] {701250, 29 }, // 20라 보스
        new[] {23270, 19 },
        new[] {25776, 20 },
        new[] {33652, 21 },
        new[] {45466, 22 },
        new[] {56743, 23 },
        new[] {67662, 36 },
        new[] {83235, 37 },
        new[] {93080, 38 },
        new[] {114560, 40 },
        new[] {6187500, 115 }, // 30라 보스
        new[] {450170, 53 },
        new[] {553420, 54 },
        new[] {660800, 56 },
        new[] {745878, 57 },
        new[] {899266, 69 },
        new[] {1025892, 70 },
        new[] {1143184, 82 },
        new[] {1197700, 82 },
        new[] {1, 39 },
        new[] {23925000, 170 }, //40라 보스
        new[] {165200, 94 },
        new[] {2065000, 95 },
        new[] {2891000, 96 },
        new[] {3717000, 97 },
        new[] {4956000, 110 },
        new[] {5782000, 111 },
        new[] {6195000, 112 },
        new[] {7161420, 123 },
        new[] {7847000, 124 },
        new[] {87450000, 245 }, // 50라 보스
        new[] {16380000, 124 },
        new[] {17850000, 125 },
        new[] {19740000, 126 },
        new[] {21000000, 138 },
        new[] {23992500, 139 },
        new[] {27195000, 140 },
        new[] {29874600, 140 },
        new[] {31920000, 141 },
        new[] {34650000, 142 },
        new[] {179850000, 350 }, // 60라 보스
        new[] {65345000, 177 },
        new[] {68363000, 178 },
        new[] {75349000, 179                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         },
        new[] {79341000, 180 },
        new[] {84926200, 183 },
        new[] {93812000, 187 },
        new[] {101796000, 181 },
        new[] {108960200, 182 },
        new[] {115668200, 206 },
        new[] {124251000, 180 },
        new[] {135549488, 186 },
        new[] {139297600, 180 },
        new[] {155787792, 194 },
        new[] {165767792, 190 },
        new[] {161775792, 191 }
    };

    public int[][] finalBossStats = new int[3][]{

        new[] {101450248, 360 },
        new[] {106804500, 380 },
        new[] {112158752, 395 },
    };
    static public DataManager Instance = null;
    void Start()
    {
        Instance = this;
    }

    // Update is called once per frame
    void Update()
    {
        
    }
}
